using System;
using System.Collections.Generic;
using System.Text;
using Urho;

namespace HolographicsDrone.Drone
{
    ///-------------------------------------------------------------------




     ///-------------------------------------------------------------------
    ///
    /// <summary>
    /// Компанент, который создает дрона
    /// </summary>
    ///
    ///--------------------------------------------------------------------
    public class ADrone
            :
                Component
    {
        ///-------------------------------------------------------------------

        ///-------------------------------------------------------------------




         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public ADrone()
        {
            //createModel();

        }
        ///--------------------------------------------------------------------





         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// система создание модели
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        private void createModel()
        {
            /*
            var cache = Application.ResourceCache;
            var model = Cre CreateComponent<StaticModel>();
            model.Model = cache.GetModel("robot.mdl");
            model.SetMaterial(cache.GetMaterial("robot.xml"));*/
        }
        ///--------------------------------------------------------------------





    }
}
