using System;
using System.Collections.Generic;
using System.Text;
using Urho;
using Urho.Gui;


namespace HolographicsDrone.GUI
{
    ///-------------------------------------------------------------------

    ///-------------------------------------------------------------------






     ///-------------------------------------------------------------------
    ///
    /// <summary>
    /// Интерфейс 
    /// </summary>
    ///
    ///--------------------------------------------------------------------
    public class AMainHUD
            :
                Component
    {
        ///-------------------------------------------------------------------
        private readonly Text mScanning = null; //надпись о процессе сканирования





         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public AMainHUD()
        {
            ReceiveSceneUpdates = true;



            var cache = Application.ResourceCache;

            mScanning = new Text();
            mScanning.Visible = false;
            mScanning.Value = "[error]";
            mScanning.SetColor(Color.Red);
            mScanning.SetFont(font: cache.GetFont("Fonts/Anonymous Pro.ttf"), size: 100);
            mScanning.SetAlignment(HorizontalAlignment.Center, VerticalAlignment.Center);
            Application.UI.Root.AddChild(mScanning);


        }
        ///--------------------------------------------------------------------







         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// инциализация сцены
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public override void OnSceneSet(Scene scene)
        {


    
        }
        ///--------------------------------------------------------------------







         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Обновление
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        protected override void OnUpdate(float timeStep)
        {
 

        }
        ///--------------------------------------------------------------------






         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Начало сканирвоания
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public void startScanning()
        {
            mScanning.Visible = true;
            mScanning.Value = ".:Scanning:.";
        }
        ///--------------------------------------------------------------------




         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Конец сканирования
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public void stopScanning()
        {
            mScanning.Visible = false;
            mScanning.Value = "";
        }
        ///--------------------------------------------------------------------




        ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// РїСЂРёСЃРѕРµРґРµРЅСЏРј РґСЂРѕРЅР° Рє СѓРїСЂР°РІР»РµРЅРёСЋ
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        private void attachDrone()
        {

        }
        ///--------------------------------------------------------------------




    }
}
