using System;
using System.Collections.Generic;
using System.Text;
using Urho;

namespace HolographicsDrone.Scenario
{
    ///-------------------------------------------------------------------
    using HolographicsDrone.Drone;
    using Utils;
    ///-------------------------------------------------------------------






     ///-------------------------------------------------------------------
    ///
    /// <summary>
    /// Сценарий взаимодействия квадракоптера
    /// </summary>
    ///
    ///--------------------------------------------------------------------
    public class AScenarioHololens
            :
                AScenario
    {
        ///-------------------------------------------------------------------
     
     




         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        public AScenarioHololens()
        {
            
        }
        ///--------------------------------------------------------------------








         ///-------------------------------------------------------------------
        ///
        /// <summary>
        /// создание и получение квадрика
        /// </summary>
        ///
        ///--------------------------------------------------------------------
        protected override void onCreateDrone()
        {
            base.onCreateDrone();
            var gamepad = mDrone.GetOrCreateComponent<AControlBluetoothJoy>(); //управление дроном через клаву
        }
        ///--------------------------------------------------------------------






    }
}
